app/controllers/students_controller.rb

      def update
        @student = Student.find(params[:id])
        @student.update(student_params(:first_name, :last_name))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Michael"], ["updated_at", "2019-12-10 14:42:22.569014"], ["id", 3]]